{
  "mainHeading": "Alphabet, formale Sprachen und Grammatiken",
  "content": [
    {
      "heading": "Einführung",
      "text": "Die Automatentheorie dient der Modellierung von Algorithmen und der maschinellen Prüfung auf Gültigkeit. Automaten sind Zustandsmodelle, welche eine Eingabe entgegennehmen, diese Stück für Stück einlesen und validieren, ob diese Eingabe akzeptiert wird oder nicht."
    },
    {
      "text": "Ein gängiges Beispiel ist das eines Fahrkartenautomaten. Eine Fahrkarte kostet 1.50€. Es sind 0.50€ und 1€ Münzen erlaubt. Ein Automat würde nun einen Startzustand vorgeben, welcher 0.50€ oder 1€ akzeptiert. Wirft ein Kunde 1€ in den Automaten würde sich der Zustand ändern und der Folgezustand erlaubt nur noch 0.50€ Münzen. Hätte der Kunde alternativ am Anfang eine 0.50€ Münze eingeworfen, wäre er in einem anderen Folgezustand gelandet, von wo aus er erneut 0.50€ oder 1€ hätte einwerfen können."
    },
    {
      "text": "Ein Automat gibt sogenannte Endzustände vor. Wirft der Kunde einen falschen Betrag oder nicht genügend Geld in den Automaten, dann gelangt er in keinen der festgelegten Endzustände (welche nach der Eingabe von 1.50€ erreicht werden). Somit ist seine Eingabe nicht valide."
    },
    {
      "heading": "Alphabet",
      "text": "Einem Automat liegt in der Regel ein Eingabealhabet zu Grunde. Ein solches Alphabet kann aus diversen Zeichen bestehen. Aus Buchstaben, Symbolen, aber auch Zahlen. Ein solches Eingabealphabet definiert, welche Eingaben ein Automat überhaupt erlaubt. Im Falle des Fahrkartenautomats besteht das Eingabealphabet aus den beiden Werten 0.50€ und 1€"
    },
    {
      "heading": "Grammatiken und formale Sprachen",
      "text": "Grammatiken geben Konstruktionsregeln an, um festzulegen ob eine Eingabe gültig ist oder nicht. Auch wenn das Alphabet mit 0.50€ und 1€ bereits die Möglichkeiten einschränkt, so könnte ein Fahrgast dennoch auch zweimal 1€ in den Automaten einwerfen. Grammatiken geben Regeln vor mit denen sich prüfen lässt, ob eine Eingabe valide war oder nicht."
    },
    {
      "text": "Formale Sprachen nutzen die Kombination aus Grammatiken und dem zugrunde liegenden Alphabet. Eine formale Sprache gibt schlussendlich einfach nur vor, welche Wörter (mehrere zusammenhängende Zeichen des Alphabets) akzeptiert werden."
    },
    {
      "text": "Das Alphebet, formale Sprachen und Grammatiken bilden die formale Repräsentation eines Automaten."
    }
  ]
}