{
  "mainHeading": "Alphabet, formale Sprachen und Grammatiken",
  "content": [
    {
      "heading": "Einführung",
      "text": "Die Automatentheorie dient der Modellierung von Algorithmen und der maschinellen Prüfung auf Gültigkeit. Automaten sind Zustandsmodelle, die eine Eingabe entgegennehmen, sie schrittweise einlesen und entscheiden, ob diese Eingabe akzeptiert wird oder nicht."
    },
    {
      "text": "Ein gängiges Beispiel ist ein Fahrkartenautomat. Eine Fahrkarte kostet 1,50 €. Zulässig sind 0,50 €- und 1 €-Münzen. Der Automat startet in einem Anfangszustand, der 0,50 € oder 1 € akzeptiert. Wirft eine Person 1 € ein, wechselt der Automat in einen Folgezustand, in dem nur noch 0,50 € erlaubt ist. Hätte die Person stattdessen zunächst 0,50 € eingeworfen, wäre sie in einem anderen Folgezustand gelandet, von dem aus erneut 0,50 € oder 1 € möglich sind."
    },
    {
      "text": "Ein Automat definiert Endzustände. Wird ein falscher Betrag oder insgesamt zu wenig Geld eingeworfen, landet der Automat in keinem Endzustand (der nach 1,50 € erreicht wird). Die Eingabe gilt dann als nicht gültig."
    },
    {
      "heading": "Alphabet",
      "text": "Einem Automaten liegt in der Regel ein Eingabealphabet zugrunde. Dieses Alphabet kann aus Buchstaben, Symbolen oder Zahlen bestehen und legt fest, welche Eingaben überhaupt erlaubt sind. Im Beispiel des Fahrkartenautomaten besteht das Eingabealphabet aus den Symbolen 0,50 € und 1 €."
    },
    {
      "heading": "Grammatiken und formale Sprachen",
      "text": "Grammatiken beschreiben Konstruktionsregeln, mit denen festgelegt wird, ob eine Eingabe gültig ist. Auch wenn das Alphabet (0,50 € und 1 €) die Möglichkeiten einschränkt, könnte eine Person z. B. zweimal 1 € einwerfen. Die Grammatik gibt Regeln vor, anhand derer sich prüfen lässt, ob die gesamte Eingabe gültig war."
    },
    {
      "text": "Formale Sprachen nutzen die Kombination aus Grammatik und zugrunde liegendem Alphabet. Eine formale Sprache legt letztlich fest, welche Wörter (also Folgen von Alphabet-Symbolen) akzeptiert werden."
    },
    {
      "text": "Alphabet, formale Sprachen und Grammatiken bilden zusammen die formale Grundlage, auf der Automaten definiert und analysiert werden."
    }
  ]
}
