{
  "mainHeading": "Grafische Repräsentation von Automaten",
  "content": [
    {
      "heading": "Deterministischer endlicher Automat (DEA)",
      "text": "Ein Automat kann entweder formal oder grafisch dargestellt werden. Die formale Schreibweise eines endlichen Automaten wird in einem späteren Kapitel betrachtet."
    },
    {
      "text": "Die grafische Repräsentation kann dabei helfen, einen Automaten leichter zu verstehen und nachzuvollziehen. Jeder endliche Automat besteht aus einer endlichen Menge an Zuständen, welche in Form von einfachen Kreisen dargestellt werden. Endzustände werden als doppelte Kreise visualisiert."
    },
    {
      "text": "Der Übergang von einem Zustand zu einem Folgezustand mittels eines Eingabezeichens aus dem Eingabealphabet bezeichnet man Transition. Transitionen werden typischerweise mit einem Pfeil von einem Zustand X zu einem Zustand X+1 eingezeichnet und mit dem erlaubten Eingabezeichen, bzw. den erlaubten Eingabezeichen versehen."
    },
    {
      "text": "Der Startzustand wird mit einem Transitionspfeil ohne Eingabezeichen und ohne Anfangszustand eingezeichnet.",
      "image": "chapterOne/dea.png",
      "imageAltText": "Bild: Startzustand Z1 in rot. Führt mit Eingabezeichen A zu grünem Folgezustand Z2 und mit Eingabezeichen B zu lila Endzustand Z3. Eine Transition mit dem Eingabezeichen C führt von Z3 wieder in zu Z2.",
      "imageSubText": "Der abgebildete Automat verfügt über einen Startzustand Z1 in rot. Von diesem Zustand Z1 kann mittels A-Transition der Folgezustand Z2 (grün) und von dort mittels B-Transition der Endzustand Z3 (lila) erreicht werden. Eine C-Transition von Z3 nach Z2 erlaubt beliebig viele cb-Postfixe eines Eingabewortes."
    },
    {
      "heading": "Nichtdeterministischer endlicher Automat (NEA)",
      "text": "Wie ein DEA auch verfügt der NEA über einen einzelnen Startzustand, welcher mittels Transitionspfeil ohne Anfang und Eingabezeichen visualisiert wird. Ebenfalls wie beim DEA verfügt der NEA über beliebig viele Zustände und Endzustände, wobei letztere auch mit zwei Kreisen markiert werden."
    },
    {
      "text": "Der Unterschied zwischen DEA und NEA liegt in der Darstellung der Transitionen. Die Kombination aus Anfangszustand und Transitionszeichen kann beim DEA immer nur zu einem Folgezustand führen. Beim NEA kann diese Kombination zu diversen Folgezuständen führen."
    },
    {
      "text": "Ein gültiger NEA wäre:",
      "image": "chapterOne/nea.png",
      "imageAltText": "Bild: Startzustand Z1 in rot. Führt mit Eingabezeichen A zu grünem Folgezustand Z2 und mit Eingabezeichen B zu lila Endzustand Z3. Eine Transition mit dem Eingabezeichen C führt von Z3 wieder in zu Z2. Zusätzlich führt eine C-Transition von Z3 auch wieder zu Z3.",
      "imageSubText": "Der abgebildete Automat verfügt über einen Startzustand Z1 in rot. Von diesem Zustand Z1 kann mittels A-Transition der Folgezustand Z2 (grün) und von dort mittels B-Transition der Endzustand Z3 (lila) erreicht werden. Eine C-Transition von Z3 nach Z2 erlaubt beliebig viele cb-Postfixe eines Eingabewortes. Alternativ erlaubt die C-Transition von Z3 nach Z3 beliebig viele c-Postfixe."
    }
  ]
}
